class Test_data:
    success_data = [
        {"username":"16653231839",
        "password":"123456",
        "hope":"首页 - 柠檬云财税"}
    ]

    fail_password_data = [
        {"username": "16653231839",
        "password": "",
        "hope": "柠檬云财务软件-永久免费的专业财务软件系统-智能生成资产负债表|现金流量表|利润表|科目汇总表-会计做账|记账表格-会计软件有哪些-出纳管理软件-企业财务管理系统"}
    ]

    fail_username_data = [
        {"username": "",
        "password": "123456",
        "hope": "柠檬云财务软件-永久免费的专业财务软件系统-智能生成资产负债表|现金流量表|利润表|科目汇总表-会计做账|记账表格-会计软件有哪些-出纳管理软件-企业财务管理系统"}
    ]

    fail_bost_data = [
        {"username": "",
        "password": "",
        "hope": "柠檬云财务软件-永久免费的专业财务软件系统-智能生成资产负债表|现金流量表|利润表|科目汇总表-会计做账|记账表格-会计软件有哪些-出纳管理软件-企业财务管理系统"}
    ]