A=56
B=78
C=0
a="请输入内容"
print("当前情况如下")
print("A=",A,"\t\tB=",B)
print("_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_")
while True:
    a = input("请输入+或-\n:")
    if a == "+":
        C=A
        A=B
        B=C
        print("当前情况如下")
        print("A=", A, "\t\tB=", B)
        print("_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_")
    elif a == "-":
        C=B
        B=A
        A=C
        print("当前情况如下")
        print("A=", A, "\t\tB=", B)
        print("_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_")
    else:
        print("_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_")
        print("\t\t\t您逗我玩呢?")
        print("_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_")