class 学生():
    学号 = ""
    姓名 = ""
    年龄 = ""
    性别 = ""
    身高 = 0
    体重 = 0
    成绩 = 0
    住址 = 0
    电话 = ""
    def 学习 (self,学习时间):
        pass
    def 玩游戏(self,游戏名):
        pass
    def 编程(self,代码行数):
        pass
    def 数的求和(self,*多参数):
        print(多参数)
        a = 0
        for i in 多参数:
            a = a + i
        print(a)

class 车():
    车型 = ""
    轮数 = 0
    颜色 = ""
    车重 = 0
    油箱 = 0
    def 跑(self,功能):
        print(车.车型,"有",车.轮数,"个轮子,重",车.车重,"KG,油箱容积",车.油箱,"升,",车.颜色,"的",功能)
    def set(self,车型,颜色,轮数,车重,油箱):
        车.车型 = 车型
        车.颜色 = 颜色
        车.轮数 = 轮数
        车.车重 = 车重
        车.油箱 = 油箱

class 笔记本():
    型号 = ""
    待机时间 = ""
    颜色 = ""
    重量 = 0.0
    cpu = ""
    内存大小 = 0
    硬盘大小 = 0
    def set(self,型号,颜色,cpu,内存大小,硬盘大小,待机时间):
        self.颜色 = 颜色
        self.型号=型号
        self.cpu=cpu
        self.内存大小=内存大小
        self.硬盘大小=硬盘大小
        self.待机时间=待机时间
    def 打游戏(self,游戏名):
        print(self.型号,"正在打",游戏名,"不亦乐乎")
    def 办工(self):
        print(self.型号,"正在办工")

class 猴子():
    类别 = ""
    性别 = ""
    颜色 = ""
    体重 = 0
    def set(self,类别,性别,颜色,体重):
        self.类别 = 类别
        self.性别 = 性别
        self.颜色 = 颜色
        self.体重 = 体重
    def 造火(self,使用物品):
        print(self.类别,"正在尝试用",使用物品,"造火")
    def 学习事物(self,*事物):
        print(self.类别,"正在学习使用:",事物)
c1 = 学生()
c1.数的求和(1,2,3,4,5,6,7,8,9)

法拉利 = 车()
法拉利.set("法拉利","红色",4,1400,50)
法拉利.跑("超级跑车")

宝马 = 车()
宝马.set("宝马","蓝色",4,1500,40)
法拉利.跑("性能车")

铃木 = 车()
铃木.set("鈴木","黑色",2,300,20)
铃木.跑("赛道机车")

五菱宏光 = 车()
五菱宏光.set("五菱维特","银色",4,1100,40)
五菱宏光.跑("漂移赛特制车")

拖拉机 = 车()
拖拉机.set("拖拉机","绿色",4,2200,60)
拖拉机.跑("越野车")

神舟 = 笔记本()
神舟.set("战神ZX8Cp5S1","黑粗大","英特尔i5-8400",16,3068,30)
神舟.打游戏("EVE ONLINE")

雯雯 = 猴子()
雯雯.set("金丝猴","女","金色",60)
雯雯.造火(神舟.型号)
雯雯.学习事物(铃木.车型,)